backend/app/controllers/habits_controller.rb

  def index
    @habits = Habit.all
---
SELECT "habits".* FROM "habits"